<a href="#"><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></a> 



<div align="right"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>&nbsp;3&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;6&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;7&nbsp;Medium</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I01-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>Inbound "From Any allow Any service" rules from Public IPs</td>

</tr>
<tr>

<td>I02-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>Inbound "From Any allow all TCP" rules from Public IPs</td>

</tr>
<tr>

<td>I03-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>Inbound "From Any allow all UDP" rules from Public IPs</td>

</tr>
<tr>

<td>I04-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>"Any" service can enter your network from Public IPs</td>

</tr>
<tr>

<td>I05-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>TCP on all ports can enter your network from Public IPs</td>

</tr>
<tr>

<td>I06-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>UDP on all ports can enter your network from Public IPs</td>

</tr>
<tr>

<td>I07-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>LDAP Port TCP/389, UDP/389 open from Public IPs</td>

</tr>
<tr>

<td>I08-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>Port 3020 can enter your network from Public IPs</td>

</tr>
<tr>

<td>I09-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>Database port TCP/9000 can enter your network from Public IPs</td>

</tr>
<tr>

<td>I02-NI-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>TCP on all ports can enter your network from Private IPs</td>

</tr>
<tr>

<td>I03-NI-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security, src</td>

<td>UDP on all ports can enter your network from Private IPs</td>

</tr>
<tr>

<td>I13-NI-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>Risky TCP Microsoft services can enter your network from Private IPs</td>

</tr>
<tr>

<td>I21-NI-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security</td>

<td>Administrative port 22 (ssh) can enter your network from more than 256 Private IPs</td>

</tr>
<tr>

<td>I23-NI-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>security, src</td>

<td>Risky UDP Microsoft services can enter your network from Private IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>compute</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_health_check.devsecopshealing will be created
  + resource "google_compute_health_check" "devsecopshealing" {
      + check_interval_sec  = 5
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "devsecops-health-check"
      + project             = (known after apply)
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 10

      + http_health_check {
          + port         = 8080
          + proxy_header = "NONE"
          + request_path = "/healthz"
        }

      + log_config {
          + enable = (known after apply)
        }
    }

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "devsecops-instance"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "devsecops-network-gcp"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_route.foobar will be created
  + resource "google_compute_route" "foobar" {
      + dest_range             = "192.168.0.0/16"
      + id                     = (known after apply)
      + name                   = "devsecops-route"
      + network                = "devsecops-network-gcp"
      + next_hop_instance_zone = (known after apply)
      + next_hop_ip            = "192.168.1.1"
      + next_hop_network       = (known after apply)
      + priority               = 100
      + project                = (known after apply)
      + self_link              = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/GCP/compute\tmp\compute.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/GCP/compute\\tmp\\compute.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>GCP</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 1460
      + name                            = "devsecops-network-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/GCP\tmp\GCP.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/GCP\\tmp\\GCP.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>security</b></h3><div  align="right"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>&nbsp;3&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;6&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;5&nbsp;Medium</div></summary>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>  I01-I-GCP</summary> 

### **Title:**
Inbound "From Any allow Any service" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with service Any : PASS" are usually more open than is necessary. Allowing all services allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected from internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>all</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>  I02-I-GCP</summary> 

### **Title:**
Inbound "From Any allow all TCP" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with all TCP : PASS" are usually more open than is necessary. Allowing all TCP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected to the Internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>  I03-I-GCP</summary> 

### **Title:**
Inbound "From Any allow all UDP" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with all UDP : PASS" are usually more open than is necessary. Allowing all UDP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected to the Internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I04-I-GCP</summary> 

### **Title:**
"Any" service can enter your network from Public IPs

### **Description:**
Allowing the "Any" service to enter your network is extremely risky since the "Any" service includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs.

### **Recommendation:**
Review all the rules that allow inbound traffic with 
"Any" service, and limit them to those services you 
actually require.  

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>all</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I05-I-GCP</summary> 

### **Title:**
TCP on all ports can enter your network from Public IPs

### **Description:**
Allowing TCP on all ports to enter your network is extremely riskysince this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 

### **Recommendation:**
Review all the rules that allow inbound traffic with TCP on all ports, and limit them to those services you actually require. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I06-I-GCP</summary> 

### **Title:**
UDP on all ports can enter your network from Public IPs

### **Description:**
Allowing UDP on all ports to enter your network is extremely risky since this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 

### **Recommendation:**
Review all the rules that allow inbound traffic with UDP on all ports, and limit them to those services you actually require. 
    

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I07-I-GCP</summary> 

### **Title:**
LDAP Port TCP/389, UDP/389 open from Public IPs

### **Description:**
Your cloud  LDAP server is accessible using the LDAP port (UDP/389, TCP/389).  LDAP (Lightweight Directory Access Protocol) is a directory service for controling access to network capable devices. Allowing access to these ports from public IP addresses is risky.


### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.


### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I08-I-GCP</summary> 

### **Title:**
Port 3020 can enter your network from Public IPs

### **Description:**
Your cloud estate is accessible using file sharing Protocol CIFS over port 3020. Allowing file sharing access from public IP addresses is risky.

### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I09-I-GCP</summary> 

### **Title:**
Database port TCP/9000 can enter your network from Public IPs

### **Description:**
Your cloud Hadoop database is accessible using administrative port TCP/9000. Hadoop is a framework for distributed data processing that allows access to the data and may act as database. Opening Hadoop port for public IPs is risky

### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  I02-NI-GCP</summary> 

### **Title:**
TCP on all ports can enter your network from Private IPs

### **Description:**
Allowing TCP on all ports to enter your network is extremely riskysince this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus.

### **Recommendation:**
Review all the rules that allow inbound traffic with TCP on all ports, and limit them to those services you actually require.  

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.0.0/16</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>null</td>

  <td>null</td>

  <td>tcp</td>

  <td>192.168.1.1/32,192.168.1.2/32,192.168.1.3/32,192.168.1.4/32,192.168.1.5/32</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  I03-NI-GCP</summary> 

### **Title:**
UDP on all ports can enter your network from Private IPs

### **Description:**
Allowing UDP on all ports to enter your network is extremely risky since this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 
    

### **Recommendation:**
Review all the rules that allow inbound traffic with UDP on all ports, and limit them to those services you 
actually require. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>udp</td>

  <td>192.168.1.1/32,192.168.1.2/32,192.168.1.3/32,192.168.1.4/32,192.168.1.5/32</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  I13-NI-GCP</summary> 

### **Title:**
Risky TCP Microsoft services can enter your network from Private IPs

### **Description:**
 Allowing Microsoft's NetBIOS services (TCP/135, TCP/139, TCP/445, TCP/593) to cross into your network is extremely risky. These services provide file and printer sharing for Microsoft Windows machines, and are among the most attacked services on the Internet . These Microsoft services are a vector for worms and viruses, and they potentially expose your network and data. 
    

### **Recommendation:**
Eliminate rules which allow access to this port from private IPs.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td>192.168.1.1/32</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  I21-NI-GCP</summary> 

### **Title:**
Administrative port 22 (ssh) can enter your network from more than 256 Private IPs

### **Description:**
Allowing access from more than 256 Private IP addresses using the SSH service (TCP/22) is risky.  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from too many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  I23-NI-GCP</summary> 

### **Title:**
Risky UDP Microsoft services can enter your network from Private IPs

### **Description:**
 Allowing Microsoft's NetBIOS services (UDP/137, UDP/138) to cross into your network is extremely risky. These services provide file and printer sharing for Microsoft Windows machines, and are among the most attacked services on the Internet . These Microsoft services are a vector for worms and viruses, and they potentially expose your network and data. 
    

### **Recommendation:**
Eliminate rules which allow access to this port from private IPs.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>udp</td>

  <td>192.168.1.1/32,192.168.1.2/32,192.168.1.3/32,192.168.1.4/32,192.168.1.5/32</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.i01-ni-gcp will be created
  + resource "google_compute_firewall" "i01-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "INGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-all"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # google_compute_firewall.i04-ni-gcp will be created
  + resource "google_compute_firewall" "i04-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "INGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-single-port"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "389",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "389",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.i05-06-ni-gcp will be created
  + resource "google_compute_firewall" "i05-06-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "INGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-multi-ports"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "3020-3050",
              + "9000",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "3020-3050",
              + "9000",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.i14-ni-gcp will be created
  + resource "google_compute_firewall" "i14-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "INGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-single-ip"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "135",
              + "139",
              + "445",
              + "593",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.i21-ni-gcp will be created
  + resource "google_compute_firewall" "i21-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "INGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-cidr-ip"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.0.0/16",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.i23-ni-gcp will be created
  + resource "google_compute_firewall" "i23-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "INGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-multi-ip"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
          + "192.168.1.2/32",
          + "192.168.1.3/32",
          + "192.168.1.4/32",
          + "192.168.1.5/32",
        ]

      + allow {
          + ports    = [
              + "137",
              + "138",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.o01-ni-gcp will be created
  + resource "google_compute_firewall" "o01-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "EGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-multi-ip-egress"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
          + "192.168.1.2/32",
          + "192.168.1.3/32",
          + "192.168.1.4/32",
          + "192.168.1.5/32",
        ]

      + allow {
          + ports    = [
              + "all",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.o02-ni-gcp will be created
  + resource "google_compute_firewall" "o02-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "EGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-all-egress"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # google_compute_firewall.o03-ni-gcp will be created
  + resource "google_compute_firewall" "o03-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "EGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-cidr-ip-egress"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.0.0/16",
        ]

      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_firewall.o05-ni-gcp will be created
  + resource "google_compute_firewall" "o05-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "EGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-single-port-egress"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "21",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.o06-ni-gcp will be created
  + resource "google_compute_firewall" "o06-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "EGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-multi-ports-egress"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "25-400",
              + "465",
              + "587",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.o07-ni-gcp will be created
  + resource "google_compute_firewall" "o07-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "EGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-single-ip-egress"
      + network            = "devsecops-network-gcp"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "all",
            ]
          + protocol = "udp"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/GCP/security\tmp\security.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/GCP/security\\tmp\\security.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>src</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;2&nbsp;Medium</div></summary>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  I03-NI-GCP</summary> 

### **Title:**
UDP on all ports can enter your network from Private IPs

### **Description:**
Allowing UDP on all ports to enter your network is extremely risky since this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 
    

### **Recommendation:**
Review all the rules that allow inbound traffic with UDP on all ports, and limit them to those services you 
actually require. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>udp</td>

  <td>192.168.1.1/32,192.168.1.2/32,192.168.1.3/32,192.168.1.4/32,192.168.1.5/32</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  I23-NI-GCP</summary> 

### **Title:**
Risky UDP Microsoft services can enter your network from Private IPs

### **Description:**
 Allowing Microsoft's NetBIOS services (UDP/137, UDP/138) to cross into your network is extremely risky. These services provide file and printer sharing for Microsoft Windows machines, and are among the most attacked services on the Internet . These Microsoft services are a vector for worms and viruses, and they potentially expose your network and data. 
    

### **Recommendation:**
Eliminate rules which allow access to this port from private IPs.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>udp</td>

  <td>192.168.1.1/32,192.168.1.2/32,192.168.1.3/32,192.168.1.4/32,192.168.1.5/32</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.i23-ni-gcp will be created
  + resource "google_compute_firewall" "i23-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-multi-ip"
      + network            = "devsecops-network-gcp"
      + priority           = 1400
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
          + "192.168.1.2/32",
          + "192.168.1.3/32",
          + "192.168.1.4/32",
          + "192.168.1.5/32",
        ]

      + allow {
          + ports    = [
              + "137",
              + "138",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 1460
      + name                            = "devsecops-network-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\tmp\src.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\\tmp\\src.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @Artsemil<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD